src/InformationRegisters/ДвижениеКонтингента/ДвижениеКонтингента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="47e8464e-9763-4317-a4ae-4ca6ebcc7602">
  <name>ДвижениеКонтингента</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="9ea5ce08-4d4b-499b-9408-67a197d2f908">
    <name>Статус</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources extendedConfigurationObject="5eeb9c73-65da-4613-8765-72f500d0a5bc">
    <name>Группа</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="d6b3e324-572e-4f49-af6c-e16c52bc0d94">
    <name>Студент</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/stdl_УчебныеГруппы/Module.bsl
// @strict-types
#Область ПрограммныйИнтерфейс
// Получить.
// 
// Параметры:
//  УИД - УникальныйИдентификатор
// 
// Возвращаемое значение:
//  - Неопределено
//  - СправочникСсылка.УчебныеГруппы
Функция Получить(УИД) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	УчебныеГруппы.Ссылка
	|ИЗ
	|	Справочник.УчебныеГруппы КАК УчебныеГруппы
	|ГДЕ
	|	УНИКАЛЬНЫЙИДЕНТИФИКАТОР(УчебныеГруппы.Ссылка) = &УИД";

	Запрос.УстановитьПараметр("УИД", УИД);

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	//@skip-check property-return-type
	Возврат Выборка.Ссылка;
КонецФункции

// Получить по студенту.
// 
// Параметры:
//  Студент - СправочникСсылка.Студенты
// 
// Возвращаемое значение:
//  - Неопределено
//  - СправочникСсылка.УчебныеГруппы
Функция ПолучитьПоСтуденту(Студент) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ДвижениеКонтингентаСрезПоследних.Группа
	|ИЗ
	|	РегистрСведений.ДвижениеКонтингента.СрезПоследних КАК ДвижениеКонтингентаСрезПоследних
	|ГДЕ
	|	ДвижениеКонтингентаСрезПоследних.Студент = &Студент";
	
	Запрос.УстановитьПараметр("Студент", Студент);
	
	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;

	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	//@skip-check property-return-type
	Возврат Выборка.Группа;
КонецФункции
#КонецОбласти
